dchwebb/Kishoof/Kishoof_STM32H7B0/src/initialisation.cpp
#include <WaveTable.h>
#include "stm32h7b0xx.h"
#include "initialisation.h"
#include "GpioPin.h"


// Clock overview:
// I2S 				PLL2 P 				61.44 MHz
// SPI3 Display		PLL2 P
// ADC		 		Peripheral Clock 	8 MHz
// OCTOSPI			PPL2 R				102.4 MHz

// Main clock 8MHz (HSE) / 2 (M) * 140 (N) / 2 (P) = 280MHz
#define PLL_M1 2
#define PLL_N1 140
#define PLL_P1 2

// PPL2P used for I2S: 		8MHz / 5 (M) * 192 (N) / 5 (P) = 61.44 MHz
// PPL2R used for OctoSPI: 	8MHz / 5 (M) * 192 (N) / 3 (P) = 102.4 MHz
#define PLL_M2 5
#define PLL_N2 192
#define PLL_P2 5
#define PLL_R2 2


void InitClocks()
{
	RCC->APB4ENR |= RCC_APB4ENR_SYSCFGEN;			// Enable System configuration controller clock

	// Voltage scaling - see Datasheet page 78. VOS0 > 225MHz; VOS1 > 160MHz; VOS2 > 88MHz; VOS3 < 88MHz
	//PWR->CR3 &= ~PWR_CR3_SCUEN;						// Supply configuration update enable - this must be deactivated or VOS ready does not come on
	PWR->CR3 |= PWR_CR3_BYPASS;						// power management unit bypassed: Must be set before changing VOS

	PWR->SRDCR |= PWR_SRDCR_VOS;					// Configure voltage scaling level 0 (Highest)
	while ((PWR->CSR1 & PWR_CSR1_ACTVOSRDY) == 0);	// Check Voltage ready 1= Ready, voltage level at or above VOS selected level

	RCC->CR |= RCC_CR_HSEON;						// Turn on external oscillator
	while ((RCC->CR & RCC_CR_HSERDY) == 0);			// Wait till HSE is ready

	// Clock source to High speed external and main (M) dividers
	RCC->PLLCKSELR = RCC_PLLCKSELR_PLLSRC_HSE |
	                 PLL_M1 << RCC_PLLCKSELR_DIVM1_Pos;

	// PLL 1 dividers
	RCC->PLL1DIVR = (PLL_N1 - 1) << RCC_PLL1DIVR_N1_Pos |
			        (PLL_P1 - 1) << RCC_PLL1DIVR_P1_Pos;

	RCC->PLLCFGR |= RCC_PLLCFGR_PLL1RGE_1;			// 10: The PLL1 input (ref1_ck) clock range frequency is between 4 and 8 MHz (Will be 4MHz for 8MHz clock divided by 2)
	RCC->PLLCFGR &= ~RCC_PLLCFGR_PLL1VCOSEL;		// 0: Wide VCO range:128 to 560 MHz (default); 1: Medium VCO range: 150 to 420 MHz
	RCC->PLLCFGR |= RCC_PLLCFGR_DIVP1EN;			// Enable P divider output

	RCC->CR |= RCC_CR_PLL1ON;						// Turn on main PLL
	while ((RCC->CR & RCC_CR_PLL1RDY) == 0);		// Wait till PLL is ready

	// PLL 2 dividers
	RCC->PLLCKSELR |= PLL_M2 << RCC_PLLCKSELR_DIVM2_Pos;

	RCC->PLL2DIVR = (PLL_N2 - 1) << RCC_PLL2DIVR_N2_Pos |
					(PLL_P2 - 1) << RCC_PLL2DIVR_P2_Pos |
					(PLL_R2 - 1) << RCC_PLL2DIVR_R2_Pos;

	RCC->PLLCFGR |= RCC_PLLCFGR_PLL2RGE_1 |			// 01: The PLL2 input (ref1_ck) clock range frequency is between 4 and 8 MHz
					RCC_PLLCFGR_PLL2VCOSEL |		// 1: Medium VCO range:150 to 420 MHz
					RCC_PLLCFGR_DIVP2EN |			// Enable P divider output
					RCC_PLLCFGR_DIVR2EN;			// Enable R divider output

	RCC->CR |= RCC_CR_PLL2ON;						// Turn on PLL 2
	while ((RCC->CR & RCC_CR_PLL2RDY) == 0);		// Wait till PLL is ready

	// Peripheral scalers
	RCC->CDCCIPR |= RCC_CDCCIPR_CKPERSEL_1;			// Peripheral clock to HSE (8MHz)
	RCC->CDCFGR1 |= RCC_CDCFGR1_CDPPRE_DIV2;		// APB3 Clocks
	RCC->CDCFGR2 |= RCC_CDCFGR2_CDPPRE1_DIV2;		// APB1 Clocks
	RCC->CDCFGR2 |= RCC_CDCFGR2_CDPPRE2_DIV2;		// APB2 Clocks
	RCC->SRDCFGR |= RCC_SRDCFGR_SRDPPRE_DIV2;		// APB4 Clocks

	// By default Flash latency is set to 6 wait states - See page 161
	FLASH->ACR = FLASH_ACR_WRHIGHFREQ |
				(FLASH->ACR & ~FLASH_ACR_LATENCY) | FLASH_ACR_LATENCY_6WS;
	while ((FLASH->ACR & FLASH_ACR_LATENCY_Msk) != FLASH_ACR_LATENCY_6WS);

	RCC->CFGR |= RCC_CFGR_SW_PLL1;					// System clock switch: 011: PLL1 selected as system clock
	while ((RCC->CFGR & RCC_CFGR_SWS_Msk) != (RCC_CFGR_SW_PLL1 << RCC_CFGR_SWS_Pos));		// Wait until PLL has been selected as system clock source


	SystemCoreClockUpdate();						// Update SystemCoreClock (system clock frequency) derived from settings of oscillators, prescalers and PLL
}


void InitHardware()
{
	InitSysTick();
	InitCache();
	InitIO();										// Initialise switches and LEDs
	InitMDMA();
	InitADC();
	InitDebugTimer();
	InitI2STimer();
	InitDisplaySPI();
	InitEncoders();
}


void InitCache()
{
	// Use the Memory Protection Unit (MPU) to set up a region of memory with data caching disabled for use with DMA buffers
	MPU->RNR = 0;									// Memory region number
	MPU->RBAR = reinterpret_cast<uint32_t>(&adc);	// Store the address of the ADC_array into the region base address register

	MPU->RASR = (0b11  << MPU_RASR_AP_Pos)   |		// All access permitted
				(0b001 << MPU_RASR_TEX_Pos)  |		// Type Extension field: See truth table on p228 of Cortex M7 programming manual
				(1     << MPU_RASR_S_Pos)    |		// Shareable: provides data synchronization between bus masters. Eg a processor with a DMA controller
				(0     << MPU_RASR_C_Pos)    |		// Cacheable
				(0     << MPU_RASR_B_Pos)    |		// Bufferable (ignored for non-cacheable configuration)
				(17    << MPU_RASR_SIZE_Pos) |		// 256KB - D2 is actually 288K (size is log 2(mem size) - 1 ie 2^18 = 256k)
				(1     << MPU_RASR_ENABLE_Pos);		// Enable MPU region


	MPU->CTRL |= (1 << MPU_CTRL_PRIVDEFENA_Pos) |	// Enable PRIVDEFENA - this allows use of default memory map for memory areas other than those specific regions defined above
				 (1 << MPU_CTRL_ENABLE_Pos);		// Enable the MPU

	// Enable data and instruction caches
	SCB_EnableDCache();
	SCB_EnableICache();
}


void InitSysTick()
{
	SysTick_Config(SystemCoreClock / SYSTICK);		// gives 1ms
	NVIC_SetPriority(SysTick_IRQn, 0);
}


void InitDisplaySPI()
{
	// SPI123 configured to use PLL2P 61.44 MHz (for I2S)
	// MaAximum frequency should be 100MHz - see GC9A01 manual p. 189
	RCC->APB1LENR |= RCC_APB1LENR_SPI3EN;

	GpioPin::Init(GPIOC, 10, GpioPin::Type::AlternateFunction, 6, GpioPin::DriveStrength::VeryHigh);		// PC10: SPI3_SCK AF6
	GpioPin::Init(GPIOC, 12, GpioPin::Type::AlternateFunction, 6, GpioPin::DriveStrength::VeryHigh);		// PC12: SPI3_MOSI AF6
	//GpioPin::Init(GPIOA, 15, GpioPin::Type::AlternateFunction, 6, GpioPin::DriveStrength::High);			// PA15: SPI3_SS AF6

	// Configure SPI
	SPI3->CFG2 |= SPI_CFG2_COMM_0;					// 00: full-duplex, *01: simplex transmitter, 10: simplex receiver, 11: half-duplex
	SPI3->CFG2 |= SPI_CFG2_SSM;						// Software slave management: When SSM bit is set, NSS pin input is replaced with the value from the SSI bit
	SPI3->CR1 |= SPI_CR1_SSI;						// Internal slave select
	SPI3->CFG2 |= SPI_CFG2_SSOM;					// SS output management in master mode
	SPI3->CFG1 |= SPI_CFG1_MBR_1;					// Master Baud rate p2238: 010: ck/8; 011: ck/16; 100: ck/32; 101: ck/64
	SPI3->CFG2 |= SPI_CFG2_MASTER;					// Master selection
	SPI3->CR1 |= SPI_CR1_SPE;						// Enable SPI

	// Configure DMA
	RCC->AHB1ENR |= RCC_AHB1ENR_DMA1EN;

	DMA1_Stream0->CR |= DMA_SxCR_MSIZE_0;			// Memory size 16 bit [8 bit; 01 = 16 bit; 10 = 32 bit]
	DMA1_Stream0->CR |= DMA_SxCR_PSIZE_0;			// Peripheral size 16 bit
	DMA1_Stream0->CR |= DMA_SxCR_DIR_0;				// data transfer direction: 00: peripheral-to-memory; 01: memory-to-peripheral; 10: memory-to-memory
	DMA1_Stream0->CR |= DMA_SxCR_PL_0;				// Priority: 00 = low; 01 = Medium; 10 = High; 11 = Very High
	DMA1_Stream0->CR |= DMA_SxCR_MINC;				// Memory in increment mode
	DMA1_Stream0->PAR = (uint32_t)(&(SPI3->TXDR));	// Configure the peripheral data register address

	DMAMUX1_Channel0->CCR |= 62; 					// DMA request MUX input 62 = SPI3_TX (See p.653)
	DMAMUX1_ChannelStatus->CFR |= DMAMUX_CFR_CSOF0; // Clear synchronization overrun event flag
}


void InitAdcPins(ADC_TypeDef* ADC_No, std::initializer_list<uint8_t> channels)
{
	uint8_t sequence = 1;

	for (auto channel: channels) {
		// NB reset mode of GPIO pins is 0b11 = analog mode so shouldn't need to change
		ADC_No->PCSEL |= 1 << channel;					// ADC channel preselection register

		// Set conversion sequence to order ADC channels are passed to this function
		if (sequence < 5) {
			ADC_No->SQR1 |= channel << (sequence * 6);
		} else if (sequence < 10) {
			ADC_No->SQR2 |= channel << ((sequence - 5) * 6);
		} else if (sequence < 15)  {
			ADC_No->SQR3 |= channel << ((sequence - 10) * 6);
		} else {
			ADC_No->SQR4 |= channel << ((sequence - 15) * 6);
		}

		// 000: 1.5 ADC clock cycles; 001: 2.5 cycles; 010: 8.5 cycles;	011: 16.5 cycles; 100: 32.5 cycles; 101: 64.5 cycles; 110: 387.5 cycles; 111: 810.5 cycles
		if (channel < 10)
			ADC_No->SMPR1 |= 0b010 << (3 * channel);
		else
			ADC_No->SMPR2 |= 0b010 << (3 * (channel - 10));

