dchwebb/Kishoof/Kishoof_STM32H7B0/src/initialisation.cpp
	// Start calibration
	ADC2->CR |= ADC_CR_ADCALLIN;					// Activate linearity calibration (as well as offset calibration)
	ADC2->CR |= ADC_CR_ADCAL;
	while ((ADC2->CR & ADC_CR_ADCAL) == ADC_CR_ADCAL) {};

	/* Configure ADC Channels to be converted:
	PA6 ADC12_INP3 VcaCV
	PA7 ADC12_INP7 WavetablePosA_CV
	PB0 ADC12_INP9 Warp_Type_Pot
	PB1 ADC12_INP5 Wavetable_Pos_A_Pot
	PC0 ADC12_INP10 Warp_Amt_Trm
	PC1	ADC12_INP11	Warp_Amt_Pot
	*/
	InitAdcPins(ADC2, {3, 7, 9, 5, 10, 11});

	// Enable ADC
	ADC2->CR |= ADC_CR_ADEN;
	while ((ADC2->ISR & ADC_ISR_ADRDY) == 0) {}

	DMAMUX1_ChannelStatus->CFR |= DMAMUX_CFR_CSOF2; // Channel 2 Clear synchronization overrun event flag
	DMA1->LIFCR = 0x3F << DMA_LIFCR_CFEIF2_Pos;		// clear all five interrupts for this stream

	DMA1_Stream2->NDTR |= ADC2_BUFFER_LENGTH;		// Number of data items to transfer (ie size of ADC buffer)
	DMA1_Stream2->PAR = reinterpret_cast<uint32_t>(&(ADC2->DR));	// Configure the peripheral data register address 0x40022040
	DMA1_Stream2->M0AR = reinterpret_cast<uint32_t>(&adc.VcaCV);		// Configure the memory address (note that M1AR is used for double-buffer mode) 0x24000040

	DMA1_Stream2->CR |= DMA_SxCR_EN;				// Enable DMA and wait
	wait_loop_index = (SystemCoreClock / (100000UL * 2UL));
	while (wait_loop_index != 0UL) {
		wait_loop_index--;
	}

	ADC2->CR |= ADC_CR_ADSTART;						// Start ADC
}



void InitI2S()
{
	RCC->APB1LENR |= RCC_APB1LENR_SPI2EN;			//	Enable SPI clocks

	GpioPin::Init(GPIOB, 12, GpioPin::Type::AlternateFunction, 5);		// PB12: I2S2_WS [alternate function AF5]
	GpioPin::Init(GPIOB, 13, GpioPin::Type::AlternateFunction, 5);		// PB13: I2S2_CK [alternate function AF5]
	GpioPin::Init(GPIOB, 15, GpioPin::Type::AlternateFunction, 5);		// PB15: I2S2_SDO [alternate function AF5]

	// Configure SPI (Shown as SPI2->CGFR in SFR)
	SPI2->I2SCFGR |= SPI_I2SCFGR_I2SMOD;			// I2S Mode
	SPI2->I2SCFGR |= SPI_I2SCFGR_I2SCFG_1;			// I2S configuration mode: 00=Slave transmit; 01=Slave receive; 10=Master transmit*; 11=Master receive

	SPI2->I2SCFGR |= SPI_I2SCFGR_DATLEN_1;			// Data Length 00=16-bit; 01=24-bit; *10=32-bit
	SPI2->I2SCFGR |= SPI_I2SCFGR_CHLEN;				// Channel Length = 32bits

	SPI2->CFG1 |= SPI_CFG1_UDRCFG_1;				// In the event of underrun resend last transmitted data frame
	SPI2->CFG1 |= 0x1f << SPI_CFG1_DSIZE_Pos;		// Data size to 32 bits (FIFO holds 16 bytes = 4 x 32 bit words)
	SPI2->CFG1 |= 3 << SPI_CFG1_FTHLV_Pos;			// FIFO threshold level. 0001: 2-data; 0010: 3 data; 0011: 4 data

	/* I2S Clock
		PLL2: ((8MHz / 5) * 192 / 5) = 61.44 MHz
		I2S Clock: 61.44 MHz / (64  * ((2 * 10) + 0)) = 48 KHz
	*/

	RCC->CDCCIP1R |= RCC_CDCCIP1R_SPI123SEL_0;		// 001: pll2_p_ck clock selected as SPI/I2S1,2 and 3 kernel clock
	SPI2->I2SCFGR |= (10 << SPI_I2SCFGR_I2SDIV_Pos);	// Set I2SDIV to 2 with Odd factor prescaler
	//SPI2->I2SCFGR |= SPI_I2SCFGR_ODD;

	SPI2->IER |= (SPI_IER_TXPIE | SPI_IER_UDRIE);	// Enable interrupt when FIFO has free slot or underrun occurs
	NVIC_SetPriority(SPI2_IRQn, 2);					// Lower is higher priority
	NVIC_EnableIRQ(SPI2_IRQn);

	SPI2->CR1 |= SPI_CR1_SPE;						// Enable I2S

	SPI2->TXDR = (int32_t)0;						// Preload the FIFO
	SPI2->TXDR = (int32_t)0;
	SPI2->TXDR = (int32_t)0;
	SPI2->TXDR = (int32_t)0;

	SPI2->CR1 |= SPI_CR1_CSTART;					// Start I2S
}


void InitI2STimer()
{
	// Timer to try and control issues with I2S interrupt firing early
	// Uses APB1 timer clock which is Main Clock / 2 [280MHz / 2 = 140MHz] Tick is 2 * 7.14nS = 14.28nS
	RCC->APB1LENR |= RCC_APB1LENR_TIM4EN;
	TIM4->ARR = 65535;
	TIM4->PSC = 1;
}


void StartI2STimer()
{
	TIM4->EGR |= TIM_EGR_UG;
	TIM4->CR1 |= TIM_CR1_CEN;
}


uint32_t ReadI2STimer()
{
	return TIM4->CNT;
}


void InitDebugTimer()
{
	// Configure timer to use in internal debug timing - uses APB1 timer clock which is Main Clock / 2 [400MHz / 2 = 200MHz]
	// Each tick is 5ns with PSC 10nS - full range is 655.350 uS
	RCC->APB1LENR |= RCC_APB1LENR_TIM3EN;
	TIM3->ARR = 65535;
	TIM3->PSC = 1;
}


void StartDebugTimer()
{
	TIM3->EGR |= TIM_EGR_UG;
	TIM3->CR1 |= TIM_CR1_CEN;
}


float StopDebugTimer()
{
	// Return time running in microseconds
	const uint32_t count = TIM3->CNT;
	TIM3->CR1 &= ~TIM_CR1_CEN;
	return 0.01f * count;
}



void InitIO()
{
	GpioPin::Init(GPIOE, 2, GpioPin::Type::Input);				// PE2: Mode switch
	GpioPin::Init(GPIOE, 3, GpioPin::Type::Input);				// PE3: Warp_Polarity_Btn
	GpioPin::Init(GPIOD, 0, GpioPin::Type::Input);				// PD0: Octave_Up
	GpioPin::Init(GPIOD, 1, GpioPin::Type::Input);				// PD1: Octave_Down
	GpioPin::Init(GPIOD, 8, GpioPin::Type::Input);				// PD8: ChB_Mix
	GpioPin::Init(GPIOD, 9, GpioPin::Type::Input);				// PD9: ChB_RM
	GpioPin::Init(GPIOD, 10, GpioPin::Type::Input);				// PD10: B_Octave_Btn

	GpioPin::Init(GPIOD, 14, GpioPin::Type::Output);			// PD14: LED_Oct_B
}


void DelayMS(uint32_t ms)
{
	// Crude delay system
	const uint32_t now = SysTickVal;
	while (now + ms > SysTickVal) {};
}


//uint32_t __attribute__((section (".ram_d1_data"))) blankData;
uint32_t blankData;


void InitMDMA()
{
	// Initialises MDMA to background transfers of data to draw buffers for off-cpu blanking
	RCC->AHB3ENR |= RCC_AHB3ENR_MDMAEN;
	MDMA_Channel0->CCR &= ~MDMA_CCR_EN;
	MDMA_Channel0->CCR |= MDMA_CCR_PL_0;			// Priority: 00 = low; 01 = Medium; 10 = High; 11 = Very High

	MDMA_Channel0->CTCR |= MDMA_CTCR_DSIZE_1;		// Destination data size - 00: 8-bit, 01: 16-bit, *10: 32-bit, 11: 64-bit
	MDMA_Channel0->CTCR |= MDMA_CTCR_SSIZE_1;		// Source data size - 00: 8-bit, 01: 16-bit, *10: 32-bit, 11: 64-bit
	MDMA_Channel0->CTCR |= MDMA_CTCR_DINC_1;		// 10: Destination address pointer is incremented after each data transfer
	//MDMA_Channel0->CTCR |= MDMA_CTCR_SINC_1;		// 10: Source address pointer is incremented after each data transfer
	MDMA_Channel0->CTCR |= MDMA_CTCR_DINCOS_1;		// Destination increment - 00: 8-bit, 01: 16-bit, *10: 32-bit, 11: 64-bit
	//MDMA_Channel0->CTCR |= MDMA_CTCR_SINCOS_1;		// Source increment - 00: 8-bit, 01: 16-bit, *10: 32-bit, 11: 64-bit
	MDMA_Channel0->CTCR |= MDMA_CTCR_BWM;			// Bufferable Write Mode
	MDMA_Channel0->CTCR |= MDMA_CTCR_SWRM;			// Software Request Mode
	MDMA_Channel0->CTCR |= MDMA_CTCR_TRGM;			// 01: Each MDMA request triggers a block transfer

	// See p. 131: Main RAM is on AXI Bus
	MDMA_Channel0->CTBR &= ~MDMA_CTBR_SBUS;			// Source: 0* System/AXI bus; 1 AHB bus/TCM
	MDMA_Channel0->CTBR &= ~MDMA_CTBR_DBUS;			// Destination: 0* System/AXI bus; 1 AHB bus/TCM

	blankData = 0;
//	MDMA_Channel0->CSAR = (uint32_t)&blankData;		// Configure the source address

	MDMA_Channel0->CCR |= MDMA_CCR_BTIE;			// Enable Block Transfer complete interrupt

