dchwebb/Kishoof/Kishoof_STM32H7B0/src/initialisation.cpp
	NVIC_SetPriority(MDMA_IRQn, 0x3);				// Lower is higher priority
	NVIC_EnableIRQ(MDMA_IRQn);
}


void MDMATransfer(const uint8_t* srcAddr, const uint8_t* destAddr, const uint32_t bytes)
{
	MDMA_Channel0->CTCR |= ((bytes - 1) << MDMA_CTCR_TLEN_Pos);	// Transfer length in bytes - 1
	MDMA_Channel0->CBNDTR |= (bytes << MDMA_CBNDTR_BNDT_Pos);	// Number of bytes in a block

	MDMA_Channel0->CSAR = (uint32_t)srcAddr;		// Configure the source address
	MDMA_Channel0->CDAR = (uint32_t)destAddr;		// Configure the destination address

	MDMA_Channel0->CCR |= MDMA_CCR_EN;				// Enable DMA
	MDMA_Channel0->CCR |= MDMA_CCR_SWRQ;			// Software Activate the request (fires interrupt when complete)
}


void InitEncoders()
{
	// Encoder: button on PE4, up/down on PC6 and PC7
	GpioPin::Init(GPIOE, 4, GpioPin::Type::InputPullup);				// PE4: Button
	GpioPin::Init(GPIOC, 6, GpioPin::Type::AlternateFunction, 3);		// PC6: TIM8_CH1 AF3
	GpioPin::Init(GPIOC, 7, GpioPin::Type::AlternateFunction, 3);		// PC6: TIM8_CH2 AF3

	RCC->APB4ENR |= RCC_APB4ENR_SYSCFGEN;			// Enable system configuration clock: used to manage external interrupt line connection to GPIOs
	// Encoder using timer functionality - PC6 and PC7
	GPIOC->PUPDR |= GPIO_PUPDR_PUPD6_0 |			// Set encoder pins to pull up
		GPIO_PUPDR_PUPD7_0;

	RCC->APB2ENR |= RCC_APB2ENR_TIM8EN;				// Enable Timer 8
	TIM8->PSC = 0;									// Set prescaler
	TIM8->ARR = 0xFFFF; 							// Set auto reload register to max
	TIM8->SMCR |= TIM_SMCR_SMS_0 |TIM_SMCR_SMS_1;	// SMS=011 for counting on both TI1 and TI2 edges
	TIM8->SMCR |= TIM_SMCR_ETF;						// Enable digital filter
	TIM8->CNT = 32000;								// Start counter at mid way point
	TIM8->CR1 |= TIM_CR1_CEN;

}


void InitOctoSPI()
{
	GpioPin::Init(GPIOB, 2, GpioPin::Type::AlternateFunction, 9, GpioPin::DriveStrength::VeryHigh);		// PB2  OCTOSPI_CLK AF9
	GpioPin::Init(GPIOC, 9, GpioPin::Type::AlternateFunction, 9, GpioPin::DriveStrength::VeryHigh);		// PC9  OCTOSPI_IO0 AF9
	GpioPin::Init(GPIOD, 12, GpioPin::Type::AlternateFunction, 9, GpioPin::DriveStrength::VeryHigh);	// PD12 OCTOSPI_IO1 AF9
	GpioPin::Init(GPIOC, 2, GpioPin::Type::AlternateFunction, 9, GpioPin::DriveStrength::VeryHigh);		// PC2  OCTOSPI_IO2 AF9
	GpioPin::Init(GPIOD, 13, GpioPin::Type::AlternateFunction, 9, GpioPin::DriveStrength::VeryHigh);	// PD13 OCTOSPI_IO3 AF9
	GpioPin::Init(GPIOE, 7, GpioPin::Type::AlternateFunction, 10, GpioPin::DriveStrength::VeryHigh); 	// PE7  OCTOSPI_IO4 AF10
	GpioPin::Init(GPIOE, 8, GpioPin::Type::AlternateFunction, 10, GpioPin::DriveStrength::VeryHigh); 	// PE8  OCTOSPI_IO5 AF10
	GpioPin::Init(GPIOE, 9, GpioPin::Type::AlternateFunction, 10, GpioPin::DriveStrength::VeryHigh);	// PE9  OCTOSPI_IO6 AF10
	GpioPin::Init(GPIOE, 10, GpioPin::Type::AlternateFunction, 10, GpioPin::DriveStrength::VeryHigh);	// PE10 OCTOSPI_IO7 AF10
	GpioPin::Init(GPIOE, 11, GpioPin::Type::AlternateFunction, 11, GpioPin::DriveStrength::VeryHigh);	// PE11 OCTOSPI_NCS AF11
	GpioPin::Init(GPIOC, 5, GpioPin::Type::AlternateFunction, 10, GpioPin::DriveStrength::VeryHigh);	// PC5  OCTOSPI_DQS AF10

	RCC->AHB3ENR |= RCC_AHB3ENR_OSPI1EN;
	RCC->CDCCIPR |= RCC_CDCCIPR_OCTOSPISEL_1;				// kernel clock 100MHz: 00 rcc_hclk3; 01 pll1_q_ck; *10 pll2_r_ck; 11 per_ck

	// Various settings below taken from AN5050
	OCTOSPI1->CR |= OCTOSPI_CR_FMODE_0;						// Mode: 00: Indirect-write; 01: Indirect-read; 10: Automatic status-polling; 11: Memory-mapped
	OCTOSPI1->DCR1 |= (28 << OCTOSPI_DCR1_DEVSIZE_Pos);		// No. of bytes = 2^(DEVSIZE+1): 512Mb = 2^29 bytes
	OCTOSPI1->DCR1 |= (0b01 << OCTOSPI_DCR1_MTYP_Pos);		// 001: Macronix mode; 100: HyperBus memory mode; 101: HyperBus register mode
	OCTOSPI1->DCR1 |= (3 << OCTOSPI_DCR1_CSHT_Pos);			// CSHT + 1: min no CLK cycles where NCS must stay high between commands (Min 10ns for reads 40ns for writes)
	OCTOSPI1->DCR1 &= ~OCTOSPI_DCR1_CKMODE;					// Clock mode 0: CLK is low when NCS high

	OCTOSPI1->DCR2 |= (9 << OCTOSPI_DCR2_PRESCALER_Pos);	// Set prescaler to n + 1 => 102.4 MHz / 1 = 102.4 MHz

//	OCTOSPI1->DCR3 |= (3 << OCTOSPI_DCR3_CSBOUND_Pos);		// Set Chip select boundary
//	OCTOSPI1->DCR4 = 250; 									// Refresh Time: The chip select should be released every 4us
//	OCTOSPI1->TCR |= OCTOSPI_TCR_DHQC;						// Delay hold quarter cycle; See RM p881
}
